gingerologist/stm32-project-bundle/mx/tong-v2-g431k6u6/Core/Src/sidekick.c
  //  dac 0
#if (DUMP_DAC_X_MARGIN == 1)
  dac_read(RN_DAC_0_MARGIN_HIGH, &margin.val);
  printf("dac-0-margin-high %d\r\n", margin.dac53202.dac_x_margin);

  dac_read(RN_DAC_0_MARGIN_LOW, &margin.val);
  printf("dac-0-margin-low %d\r\n", margin.dac53202.dac_x_margin);
#endif

#if (DUMP_DAC_X_VOUT_CMP_CONFIG == 1)
  dac_read(RN_DAC_0_VOUT_CMP_CONFIG, &vout_cmp_config.val);
  printf("dac-0-vout-cmp-config\r\n");
  printf("  cmp-0-en: %u\r\n", vout_cmp_config.cmp_x_en);
  printf("  cmp-0-inv-en: %u\r\n", vout_cmp_config.cmp_x_inv_en);
  printf("  cmp-0-hiz-in-dis: %u\r\n", vout_cmp_config.cmp_x_hiz_in_dis);
  printf("  cmp-0-out-en: %u", vout_cmp_config.cmp_x_out_en);
  printf("  cmp-0-od-en: %u", vout_cmp_config.cmp_x_od_en);
  printf("  vout-gain-0: %u", vout_cmp_config.vout_gain_x);
#endif

  dac_read(RN_DAC_0_IOUT_MISC_CONFIG, &iout_misc_config.val);
  printf("dac-0-iout-misc-config\r\n");
  range = iout_misc_config.iout_range_x;
  index = (range < 8 || range > 11) ? 4 : range - 8;
  printf("  iout-range-0: %u, %s\r\n", range, iout_range_strs[index]);

  dac_read(RN_DAC_0_CMP_MODE_CONFIG, &cmp_mode_config.val);
  printf("dac-0-cmp-mode-config, cmp-1-mode: %u\r\n",
         cmp_mode_config.cmp_x_mode);

#if (DUMP_DAC_X_FUNC_CONFIG == 1)
  dac_read(RN_DAC_0_FUNC_CONFIG, &func_config.val);
  printf("dac-0-func-config\r\n");
  if (func_config.linear.log_slew_en_x) {
    printf("  fall-slew-0: %u\r\n", func_config.logarithmic.fall_slew_x);
    printf("  rise-slew-0: %u\r\n", func_config.logarithmic.rise_slew_x);
    printf("  log-slew-en-0: %u\r\n", func_config.logarithmic.log_slew_en_x);
    printf("  func-config-0: %u\r\n", func_config.logarithmic.func_config_x);
    printf("  phase-sel-0: %u\r\n", func_config.logarithmic.phase_sel_x);
    printf("  brd-config-0: %u\r\n", func_config.logarithmic.brd_config_x);
    printf("  sync-config-0: %u\r\n", func_config.logarithmic.sync_config_x);
    printf("  clr-sel-0: %u\r\n", func_config.logarithmic.clr_sel_x);
  } else {
    printf("  slew-rate-0: %u\r\n", func_config.linear.slew_rate_x);
    printf("  code-step-0: %u\r\n", func_config.linear.code_step_x);
    printf("  log-slew-en-0: %u\r\n", func_config.linear.log_slew_en_x);
    printf("  func-config-0: %u\r\n", func_config.linear.func_config_x);
    printf("  phase-sel-0: %u\r\n", func_config.linear.phase_sel_x);
    printf("  brd-config-0: %u\r\n", func_config.linear.brd_config_x);
    printf("  sync-config-0: %u\r\n", func_config.linear.sync_config_x);
    printf("  clr-sel-0: %u\r\n", func_config.linear.clr_sel_x);
  }
#endif

  dac_read(RN_DAC_0_DATA, &data.val);
  printf("dac-0-data: %u", data.dac53202.dac_x_data);

  dac_read(RN_COMMON_CONFIG, &common_config.val);
  printf("common-config\r\n");
  printf("  iout-pdn-1: %u\r\n", common_config.iout_pdn_1);
  printf("  vout-pdn-1: %u\r\n", common_config.vout_pdn_1);
  printf("  iout-pdn-0: %u\r\n", common_config.iout_pdn_0);
  printf("  vout-pdn-0: %u\r\n", common_config.vout_pdn_0);
  printf("  en-int-ref: %u\r\n", common_config.en_int_ref);
  printf("  ee-read-addr: %u\r\n", common_config.ee_read_addr);
  printf("  dev-lock: %u\r\n", common_config.dev_lock);
  printf("  win-latch-en: %u\r\n", common_config.win_latch_en);

#if (DUMP_COMMON_TRIGGER == 1)
  common_trigger_t common_trigger;
  dac_read(RN_COMMON_TRIGGER, &common_trigger.val);
  printf("common-trigger\r\n");
  printf("  nvm-reload: %u\r\n", common_trigger.nvm_reload);
  printf("  nvm-prog: %u\r\n", common_trigger.nvm_prog);
  printf("  read-one-trig: %u\r\n", common_trigger.read_one_trig);
  printf("  protect: %u\r\n", common_trigger.protect);
  printf("  fault-dump: %u\r\n", common_trigger.fault_dump);
  printf("  clr: %u\r\n", common_trigger.clr);
  printf("  ldac: %u\r\n", common_trigger.ldac);
  printf("  reset: %u\r\n", common_trigger.reset);
  printf("  dev-lock: %u\r\n", common_trigger.dev_unlock);
#endif

#if (DUMP_COMMON_DAC_TRIG == 1)
  common_dac_trig_t common_dac_trig;
  dac_read(RN_COMMON_DAC_TRIG, &common_dac_trig.val);
  printf("common-dac-trig\r\n");
  printf("  start-func-0: %u\r\n", common_dac_trig.start_func_0);
  printf("  trig-mar-hi-0: %u\r\n", common_dac_trig.trig_mar_hi_0);
  printf("  trig-mar-lo-0: %u\r\n", common_dac_trig.trig_mar_lo_0);
  printf("  reset-cmp-flag-0: %u\r\n", common_dac_trig.reset_cmp_flag_0);
  printf("  start-func-1: %u\r\n", common_dac_trig.start_func_1);
  printf("  trig-mar-hi-1: %u\r\n", common_dac_trig.trig_mar_hi_1);
  printf("  trig-mar-lo-1: %u\r\n", common_dac_trig.trig_mar_lo_1);
  printf("  reset-cmp-flag-1: %u\r\n", common_dac_trig.reset_cmp_flag_1);
#endif

#if (DUMP_GENERAL_STATUS == 1)
  general_status_t general_status;
  dac_read(RN_GENERAL_STATUS, &general_status.val);
  printf("general-status\r\n");
  printf("  version-id: %u\r\n", general_status.version_id);
  printf("  device-id: %u\r\n", general_status.device_id);
  printf("  dac-1-busy: %u\r\n", general_status.dac_1_busy);
  printf("  dac-0-busy: %u\r\n", general_status.dac_0_busy);
  printf("  nvm-crc-fail-user: %u\r\n", general_status.nvm_crc_fail_user);
  printf("  nvm-crc-fail-int: %u\r\n", general_status.nvm_crc_fail_int);
#endif

#if (DUMP_CMP_STATUS == 1)
  cmp_status_t cmp_status;
  dac_read(RN_CMP_STATUS, &cmp_status.val);
  printf("cmp-status\r\n");
  printf("  cmp-flag-1: %u\r\n", cmp_status.cmp_flag_1);
  printf("  cmp-flag-0: %u\r\n", cmp_status.cmp_flag_0);
  printf("  win-cmp-1: %u\r\n", cmp_status.win_cmp_1);
  printf("  win-cmp-0: %u\r\n", cmp_status.win_cmp_0);
  printf("  protect-flag: %u\r\n", cmp_status.protect_flag);
#endif

#if (DUMP_GPIO_CONFIG == 1)
  gpio_config_t gpio_config;
  dac_read(RN_GPIO_CONFIG, &gpio_config.val);
  printf("gpio-config\r\n");
  printf("  gpi-en: %u\r\n", gpio_config.gpi_en);
  printf("  gpi-config: %u\r\n", gpio_config.gpi_config);
  printf("  gpi-ch-sel: %u\r\n", gpio_config.gpi_ch_sel);
  printf("  gpo-config: %u\r\n", gpio_config.gpo_config);
  printf("  gpo-en: %u\r\n", gpio_config.gpo_en);
  printf("  gf-en: %u\r\n", gpio_config.gf_en);
#endif

